---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementBoundarySubface.SubfaceArisesFromElementFace
source: html/dfbb3c9a-fdfa-8d50-9cb8-218adbd66e40.htm
---
# Autodesk.Revit.DB.SpatialElementBoundarySubface.SubfaceArisesFromElementFace Property

Indicates if the subface is coincident with a portion of a (possibly offset) face of the element.

## Syntax (C#)
```csharp
public bool SubfaceArisesFromElementFace { get; }
```